{"pages":[],"posts":[{"title":"If you are one of the dark-mode faithful","text":"If you are one of the dark-mode faithful, this article will be actually meaningful for you :). Do you use dark-theme on Chrome browser? The answer is that pretty much user have been using it but most of website still use white background. For developers like me, the dark background is more preferred and it looks like further mystery. When I work in dark-room, dark-mode gives me a feel focus and better for my eyes. If you are actually curious why, please read further pros and cons of dark mode. Well, how to get the dark-mode for entire website browsing on Chrome? There is an easy way by using Chrome browser extension no one also know. It is Dark Reader extension from Chrome Web Store. First of all, install Dark Reader. This extension is occurred in the icon bar of Chrome. See the following image. This extension lets to set a dark style to every web pages you visit. You can do this by clicking the Dark Reader icon on the toolbar. We also can toggle the mode by click ON/OFF button. With some option in the pulldown menu, you can adjust brightness, contrast, … on the filter tab. Easy huh? Have fun with Dark Reader.","link":"/2019/07/01/If-you-are-one-of-the-dark-mode-faithful/"},{"title":"npx reveal","text":"What is npx?npx is a package management tool as npm but simplified number of things as I will list below. Start server with different Node.js Using locally installed tools Execute a command that no need globally. Start server with different Node.js1$ npx node@6 -v 1$ npx -p node@6 Using locally installed toolsExecute a command that no need globally.","link":"/2019/06/21/npx-reveal/"},{"title":"git submodule should or should not","text":"Phải nói rằng, git thực sự là một công cụ tuyệt vời trong việc quản lý code. Nhưng chính vì cái tuyệt vời đó, git cũng có những option khiến developer cảm thấy rối rắm khi sử dụng. Một trong những lựa chọn khiến tôi cũng khá đau đầu là submodule. Và đó cũng là lý do tôi tạo bài viết này để chia sẻ với các bạn. Tôi cũng tham khảo nhiều bài viết về cách sử dụng submodule nhưng một số chỉ dừng lại cách dùng rất cơ bản. Nó càng thôi thúc tôi cố gắng tìm hiểu submodule. Nào trước hết chúng ta cần phải hiểu submodule là gì. Git submodule là gì?dsadasdas Thêm một submoduleTham khảo https://git-scm.com/docs/git-submodule https://dominhhai.github.io/vi/2017/09/git-submodule-multi-repo/ https://www.vogella.com/tutorials/GitSubmodules/article.html","link":"/2019/06/21/git-submodule-should-or-should-not/"}],"tags":[{"name":"theme dark mode","slug":"theme-dark-mode","link":"/tags/theme-dark-mode/"},{"name":"git submodule","slug":"git-submodule","link":"/tags/git-submodule/"}],"categories":[]}